{"format": "graph-model", "generatedBy": "2.5.0-dev20201209", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "11"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3840"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/resizing/resize/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_2/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "34"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_2/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "34"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_6/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "11"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_85"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_76"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/time_distributed/Shape", "StatefulPartitionedCall/model/time_distributed/strided_slice/stack", "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_1", "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/time_distributed/Shape", "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack", "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_1", "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/time_distributed/Reshape/shape/0", "StatefulPartitionedCall/model/time_distributed/strided_slice", "StatefulPartitionedCall/model/time_distributed/strided_slice_1", "StatefulPartitionedCall/model/time_distributed/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/model/time_distributed/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/resizing/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/model/time_distributed/Reshape", "StatefulPartitionedCall/model/time_distributed/resizing/resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/time_distributed/resizing/resize/ResizeBilinear", "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_2/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3", "StatefulPartitionedCall/model/time_distributed_2/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/time_distributed_2/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/time_distributed_2/conv2d/Relu", "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/time_distributed_4/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/time_distributed_3/conv2d_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_6/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/time_distributed_4/max_pooling2d/MaxPool", "StatefulPartitionedCall/model/time_distributed_6/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/time_distributed_6/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/time_distributed_6/Reshape_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape", "StatefulPartitionedCall/model/lstm/strided_slice/stack", "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros_1/packed", "StatefulPartitionedCall/model/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros/packed", "StatefulPartitionedCall/model/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_81"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_79"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_27/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_27/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_18_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_17_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_20_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_21_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_52:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_67", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_85", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_20_switch/_61:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_17_switch/_56:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_20_switch/_61:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_21_switch/_62:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/input/_103", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_54:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_58:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_67", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_52:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_3", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/MatMul", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_21_switch/_62:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split/split_dim", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_18_switch/_57:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Sigmoid_2", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_55:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 609}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "shape": [3840, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "shape": [32, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed/resizing/resize/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/time_distributed_2/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 34], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_2/conv2d/BiasAdd/ReadVariableOp", "shape": [34], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 34, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_3/conv2d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_6/Reshape_1/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [32, 8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Scaled", "shape": [1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/batch_normalization/FusedBatchNormV3/Offset", "shape": [1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_28/while/add_3/y", "shape": [], "dtype": "int32"}]}]}